gmtcontrol/nuttx/arch/arm/src/ra6m5/hardware/ra6m5_sci.h
/****************************************************************************
 * arch/arm/src/ra6m5/hardware/ra6m5_sci.h
 *
 * Licensed to the Apache Software Foundation (ASF) under one or more
 * contributor license agreements.  See the NOTICE file distributed with
 * this work for additional information regarding copyright ownership.  The
 * ASF licenses this file to you under the Apache License, Version 2.0 (the
 * "License"); you may not use this file except in compliance with the
 * License.  You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.  See the
 * License for the specific language governing permissions and limitations
 * under the License.
 *
 ****************************************************************************/

#ifndef __ARCH_ARM_SRC_RA6M5_HARDWARE_RA6M5_SCI_H
#define __ARCH_ARM_SRC_RA6M5_HARDWARE_RA6M5_SCI_H

/****************************************************************************
 * Included Files
 ****************************************************************************/

#include <nuttx/config.h>
#include "chip.h"

/****************************************************************************
 * Pre-processor Definitions
 ****************************************************************************/

/* Register Offsets *********************************************************/

#define RA6M5_SCI_SMR_OFFSET    0x0000  /* Serial Mode Register */
#define RA6M5_SCI_BRR_OFFSET    0x0001  /* Bit Rate Register */
#define RA6M5_SCI_SCR_OFFSET    0x0002  /* Serial Control Register */
#define RA6M5_SCI_TDR_OFFSET    0x0003  /* Transmit Data Register */
#define RA6M5_SCI_SSR_OFFSET    0x0004  /* Serial Status Register */
#define RA6M5_SCI_RDR_OFFSET    0x0005  /* Receive Data Register */
#define RA6M5_SCI_SCMR_OFFSET   0x0006  /* Smart Card Mode Register */
#define RA6M5_SCI_SEMR_OFFSET   0x0007  /* Serial Extended Mode Register */
#define RA6M5_SCI_SNFR_OFFSET   0x0008  /* Noise Filter Setting Register */
#define RA6M5_SCI_SIMR1_OFFSET  0x0009  /* I2C Mode Register 1 */
#define RA6M5_SCI_SIMR2_OFFSET  0x000A  /* I2C Mode Register 2 */
#define RA6M5_SCI_SIMR3_OFFSET  0x000B  /* I2C Mode Register 3 */
#define RA6M5_SCI_SISR_OFFSET   0x000C  /* I2C Status Register */
#define RA6M5_SCI_SPMR_OFFSET   0x000D  /* SPI Mode Register */
#define RA6M5_SCI_FTDRH_OFFSET  0x000E  /* Transmit FIFO Data Register H */
#define RA6M5_SCI_FTDRL_OFFSET  0x000F  /* Transmit FIFO Data Register L */
#define RA6M5_SCI_FRDRH_OFFSET  0x0010  /* Receive FIFO Data Register H */
#define RA6M5_SCI_FRDRL_OFFSET  0x0011  /* Receive FIFO Data Register L */
#define RA6M5_SCI_MDDR_OFFSET   0x0012  /* Modulation Duty Register */
#define RA6M5_SCI_DCCR_OFFSET   0x0013  /* Data Compare Match Control Register */
#define RA6M5_SCI_FCR_OFFSET    0x0014  /* FIFO Control Register */
#define RA6M5_SCI_FDR_OFFSET    0x0016  /* FIFO Data Count Register */
#define RA6M5_SCI_LSR_OFFSET    0x0018  /* Line Status Register */
#define RA6M5_SCI_CDR_OFFSET    0x001A  /* Compare Match Data Register */
#define RA6M5_SCI_SPTR_OFFSET   0x001C  /* Serial Port Register */
#define RA6M5_SCI_ACTR_OFFSET   0x001D  /* Adjustment Communication Timing Register */
#define RA6M5_SCI_ESMER_OFFSET  0x0020  /* Extended Serial Module Enable Register */
#define RA6M5_SCI_CR0_OFFSET    0x0021  /* Control Register 0 */
#define RA6M5_SCI_CR1_OFFSET    0x0022  /* Control Register 1 */
#define RA6M5_SCI_CR2_OFFSET    0x0023  /* Control Register 2 */
#define RA6M5_SCI_CR3_OFFSET    0x0024  /* Control Register 3 */
#define RA6M5_SCI_PCR_OFFSET    0x0025  /* Port Control Register */
#define RA6M5_SCI_ICR_OFFSET    0x0026  /* Interrupt Control Register */
#define RA6M5_SCI_STR_OFFSET    0x0027  /* Status Register */
#define RA6M5_SCI_STCR_OFFSET   0x0028  /* Status Clear Register */
#define RA6M5_SCI_CF0DR_OFFSET  0x0029  /* Control Field 0 Data Register */
#define RA6M5_SCI_CF0CR_OFFSET  0x002A  /* Control Field 0 Compare Enable Register */
#define RA6M5_SCI_CF0RR_OFFSET  0x002B  /* Control Field 0 Receive Data Register */
#define RA6M5_SCI_PCF1DR_OFFSET 0x002C  /* Primary Control Field 1 Data Register */
#define RA6M5_SCI_SCF1DR_OFFSET 0x002D  /* Secondary Control Field 1 Data Register */
#define RA6M5_SCI_CF1CR_OFFSET  0x002E  /* Control Field 1 Compare Enable Register */
#define RA6M5_SCI_CF1RR_OFFSET  0x002F  /* Control Field 1 Receive Data Register */
#define RA6M5_SCI_TCR_OFFSET    0x0030  /* Timer Control Register */
#define RA6M5_SCI_TMR_OFFSET    0x0031  /* Timer Mode Register */
#define RA6M5_SCI_TPRE_OFFSET   0x0032  /* Timer Prescaler Register */
#define RA6M5_SCI_TCNT_OFFSET   0x0033  /* Timer Count Register */


/* Register Addresses *******************************************************/

#if RA6M5_NSCI > 0
#  define RA6M5_SCI0_SMR        (RA6M5_SCI0_BASE + RA6M5_SCI_SMR_OFFSET)
#  define RA6M5_SCI0_BRR        (RA6M5_SCI0_BASE + RA6M5_SCI_BRR_OFFSET)
#  define RA6M5_SCI0_SCR        (RA6M5_SCI0_BASE + RA6M5_SCI_SCR_OFFSET)
#  define RA6M5_SCI0_TDR        (RA6M5_SCI0_BASE + RA6M5_SCI_TDR_OFFSET)
#  define RA6M5_SCI0_SSR        (RA6M5_SCI0_BASE + RA6M5_SCI_SSR_OFFSET)
#  define RA6M5_SCI0_RDR        (RA6M5_SCI0_BASE + RA6M5_SCI_RDR_OFFSET)
#  define RA6M5_SCI0_SNFR       (RA6M5_SCI0_BASE + RA6M5_SCI_SNFR_OFFSET)
#  define RA6M5_SCI0_FTDRH      (RA6M5_SCI0_BASE + RA6M5_SCI_FTDRH_OFFSET)
#  define RA6M5_SCI0_FTDRL      (RA6M5_SCI0_BASE + RA6M5_SCI_FTDRL_OFFSET)
#  define RA6M5_SCI0_FRDRH      (RA6M5_SCI0_BASE + RA6M5_SCI_FRDRH_OFFSET)
#  define RA6M5_SCI0_FRDRL      (RA6M5_SCI0_BASE + RA6M5_SCI_FRDRL_OFFSET)
#  define RA6M5_SCI0_FCR        (RA6M5_SCI0_BASE + RA6M5_SCI_FCR_OFFSET)
#  define RA6M5_SCI0_FDR        (RA6M5_SCI0_BASE + RA6M5_SCI_FDR_OFFSET)
#  define RA6M5_SCI0_LSR        (RA6M5_SCI0_BASE + RA6M5_SCI_LSR_OFFSET)
#  define RA6M5_SCI0_SPTR       (RA6M5_SCI0_BASE + RA6M5_SCI_SPTR_OFFSET)
#  define RA6M5_SCI0_CR0        (RA6M5_SCI0_BASE + RA6M5_SCI_CR0_OFFSET)
#  define RA6M5_SCI0_CR1        (RA6M5_SCI0_BASE + RA6M5_SCI_CR1_OFFSET)
#  define RA6M5_SCI0_CR2        (RA6M5_SCI0_BASE + RA6M5_SCI_CR2_OFFSET)
#  define RA6M5_SCI0_CR3        (RA6M5_SCI0_BASE + RA6M5_SCI_CR3_OFFSET)
#  define RA6M5_SCI0_PCR        (RA6M5_SCI0_BASE + RA6M5_SCI_PCR_OFFSET)
#  define RA6M5_SCI0_ICR        (RA6M5_SCI0_BASE + RA6M5_SCI_ICR_OFFSET)
#  define RA6M5_SCI0_STR        (RA6M5_SCI0_BASE + RA6M5_SCI_STR_OFFSET)
#  define RA6M5_SCI0_STCR       (RA6M5_SCI0_BASE + RA6M5_SCI_STCR_OFFSET)
#endif

#if RA6M5_NSCI > 1
#  define RA6M5_SCI1_SMR        (RA6M5_SCI1_BASE + RA6M5_SCI_SMR_OFFSET)
#  define RA6M5_SCI1_BRR        (RA6M5_SCI1_BASE + RA6M5_SCI_BRR_OFFSET)
#  define RA6M5_SCI1_SCR        (RA6M5_SCI1_BASE + RA6M5_SCI_SCR_OFFSET)
#  define RA6M5_SCI1_TDR        (RA6M5_SCI1_BASE + RA6M5_SCI_TDR_OFFSET)
#  define RA6M5_SCI1_SSR        (RA6M5_SCI1_BASE + RA6M5_SCI_SSR_OFFSET)
#  define RA6M5_SCI1_RDR        (RA6M5_SCI1_BASE + RA6M5_SCI_RDR_OFFSET)
#  define RA6M5_SCI1_SNFR       (RA6M5_SCI1_BASE + RA6M5_SCI_SNFR_OFFSET)
#  define RA6M5_SCI1_FTDRH      (RA6M5_SCI1_BASE + RA6M5_SCI_FTDRH_OFFSET)
#  define RA6M5_SCI1_FTDRL      (RA6M5_SCI1_BASE + RA6M5_SCI_FTDRL_OFFSET)
#  define RA6M5_SCI1_FRDRH      (RA6M5_SCI1_BASE + RA6M5_SCI_FRDRH_OFFSET)
#  define RA6M5_SCI1_FRDRL      (RA6M5_SCI1_BASE + RA6M5_SCI_FRDRL_OFFSET)
#  define RA6M5_SCI1_FCR        (RA6M5_SCI1_BASE + RA6M5_SCI_FCR_OFFSET)
#  define RA6M5_SCI1_FDR        (RA6M5_SCI1_BASE + RA6M5_SCI_FDR_OFFSET)
#  define RA6M5_SCI1_LSR        (RA6M5_SCI1_BASE + RA6M5_SCI_LSR_OFFSET)
#  define RA6M5_SCI1_SPTR       (RA6M5_SCI1_BASE + RA6M5_SCI_SPTR_OFFSET)
#  define RA6M5_SCI1_CR0        (RA6M5_SCI1_BASE + RA6M5_SCI_CR0_OFFSET)
#  define RA6M5_SCI1_CR1        (RA6M5_SCI1_BASE + RA6M5_SCI_CR1_OFFSET)
#  define RA6M5_SCI1_CR2        (RA6M5_SCI1_BASE + RA6M5_SCI_CR2_OFFSET)
#  define RA6M5_SCI1_CR3        (RA6M5_SCI1_BASE + RA6M5_SCI_CR3_OFFSET)
#  define RA6M5_SCI1_PCR        (RA6M5_SCI1_BASE + RA6M5_SCI_PCR_OFFSET)
#  define RA6M5_SCI1_ICR        (RA6M5_SCI1_BASE + RA6M5_SCI_ICR_OFFSET)
#  define RA6M5_SCI1_STR        (RA6M5_SCI1_BASE + RA6M5_SCI_STR_OFFSET)
#  define RA6M5_SCI1_STCR       (RA6M5_SCI1_BASE + RA6M5_SCI_STCR_OFFSET)
#endif

#if RA6M5_NSCI > 2
#  define RA6M5_SCI2_SMR        (RA6M5_SCI2_BASE + RA6M5_SCI_SMR_OFFSET)
#  define RA6M5_SCI2_BRR        (RA6M5_SCI2_BASE + RA6M5_SCI_BRR_OFFSET)
#  define RA6M5_SCI2_SCR        (RA6M5_SCI2_BASE + RA6M5_SCI_SCR_OFFSET)
#  define RA6M5_SCI2_TDR        (RA6M5_SCI2_BASE + RA6M5_SCI_TDR_OFFSET)
#  define RA6M5_SCI2_SSR        (RA6M5_SCI2_BASE + RA6M5_SCI_SSR_OFFSET)
#  define RA6M5_SCI2_RDR        (RA6M5_SCI2_BASE + RA6M5_SCI_RDR_OFFSET)
#  define RA6M5_SCI2_SNFR       (RA6M5_SCI2_BASE + RA6M5_SCI_SNFR_OFFSET)
#  define RA6M5_SCI2_FTDRH      (RA6M5_SCI2_BASE + RA6M5_SCI_FTDRH_OFFSET)
#  define RA6M5_SCI2_FTDRL      (RA6M5_SCI2_BASE + RA6M5_SCI_FTDRL_OFFSET)
#  define RA6M5_SCI2_FRDRH      (RA6M5_SCI2_BASE + RA6M5_SCI_FRDRH_OFFSET)
#  define RA6M5_SCI2_FRDRL      (RA6M5_SCI2_BASE + RA6M5_SCI_FRDRL_OFFSET)
#  define RA6M5_SCI2_FCR        (RA6M5_SCI2_BASE + RA6M5_SCI_FCR_OFFSET)
#  define RA6M5_SCI2_FDR        (RA6M5_SCI2_BASE + RA6M5_SCI_FDR_OFFSET)
#  define RA6M5_SCI2_LSR        (RA6M5_SCI2_BASE + RA6M5_SCI_LSR_OFFSET)
#  define RA6M5_SCI2_SPTR       (RA6M5_SCI2_BASE + RA6M5_SCI_SPTR_OFFSET)
#  define RA6M5_SCI2_CR0        (RA6M5_SCI2_BASE + RA6M5_SCI_CR0_OFFSET)
#  define RA6M5_SCI2_CR1        (RA6M5_SCI2_BASE + RA6M5_SCI_CR1_OFFSET)
#  define RA6M5_SCI2_CR2        (RA6M5_SCI2_BASE + RA6M5_SCI_CR2_OFFSET)
#  define RA6M5_SCI2_CR3        (RA6M5_SCI2_BASE + RA6M5_SCI_CR3_OFFSET)
#  define RA6M5_SCI2_PCR        (RA6M5_SCI2_BASE + RA6M5_SCI_PCR_OFFSET)
#  define RA6M5_SCI2_ICR        (RA6M5_SCI2_BASE + RA6M5_SCI_ICR_OFFSET)
#  define RA6M5_SCI2_STR        (RA6M5_SCI2_BASE + RA6M5_SCI_STR_OFFSET)
#  define RA6M5_SCI2_STCR       (RA6M5_SCI2_BASE + RA6M5_SCI_STCR_OFFSET)
#endif

#if RA6M5_NSCI > 3
#  define RA6M5_SCI3_SMR        (RA6M5_SCI3_BASE + RA6M5_SCI_SMR_OFFSET)
#  define RA6M5_SCI3_BRR        (RA6M5_SCI3_BASE + RA6M5_SCI_BRR_OFFSET)
#  define RA6M5_SCI3_SCR        (RA6M5_SCI3_BASE + RA6M5_SCI_SCR_OFFSET)
#  define RA6M5_SCI3_TDR        (RA6M5_SCI3_BASE + RA6M5_SCI_TDR_OFFSET)
#  define RA6M5_SCI3_SSR        (RA6M5_SCI3_BASE + RA6M5_SCI_SSR_OFFSET)
#  define RA6M5_SCI3_RDR        (RA6M5_SCI3_BASE + RA6M5_SCI_RDR_OFFSET)
#  define RA6M5_SCI3_SNFR       (RA6M5_SCI3_BASE + RA6M5_SCI_SNFR_OFFSET)
#  define RA6M5_SCI3_FTDRH      (RA6M5_SCI3_BASE + RA6M5_SCI_FTDRH_OFFSET)
#  define RA6M5_SCI3_FTDRL      (RA6M5_SCI3_BASE + RA6M5_SCI_FTDRL_OFFSET)
#  define RA6M5_SCI3_FRDRH      (RA6M5_SCI3_BASE + RA6M5_SCI_FRDRH_OFFSET)
#  define RA6M5_SCI3_FRDRL      (RA6M5_SCI3_BASE + RA6M5_SCI_FRDRL_OFFSET)
#  define RA6M5_SCI3_FCR        (RA6M5_SCI3_BASE + RA6M5_SCI_FCR_OFFSET)
#  define RA6M5_SCI3_FDR        (RA6M5_SCI3_BASE + RA6M5_SCI_FDR_OFFSET)
#  define RA6M5_SCI3_LSR        (RA6M5_SCI3_BASE + RA6M5_SCI_LSR_OFFSET)
#  define RA6M5_SCI3_SPTR       (RA6M5_SCI3_BASE + RA6M5_SCI_SPTR_OFFSET)
#  define RA6M5_SCI3_CR0        (RA6M5_SCI3_BASE + RA6M5_SCI_CR0_OFFSET)
#  define RA6M5_SCI3_CR1        (RA6M5_SCI3_BASE + RA6M5_SCI_CR1_OFFSET)
#  define RA6M5_SCI3_CR2        (RA6M5_SCI3_BASE + RA6M5_SCI_CR2_OFFSET)
#  define RA6M5_SCI3_CR3        (RA6M5_SCI3_BASE + RA6M5_SCI_CR3_OFFSET)
#  define RA6M5_SCI3_PCR        (RA6M5_SCI3_BASE + RA6M5_SCI_PCR_OFFSET)
#  define RA6M5_SCI3_ICR        (RA6M5_SCI3_BASE + RA6M5_SCI_ICR_OFFSET)
#  define RA6M5_SCI3_STR        (RA6M5_SCI3_BASE + RA6M5_SCI_STR_OFFSET)
#  define RA6M5_SCI3_STCR       (RA6M5_SCI3_BASE + RA6M5_SCI_STCR_OFFSET)
#endif

