gmtcontrol/nuttx/arch/arm/src/ra6m5/hardware/ra6m5_sci.h
#if RA6M5_NSCI > 4
#  define RA6M5_SCI4_SMR        (RA6M5_SCI4_BASE + RA6M5_SCI_SMR_OFFSET)
#  define RA6M5_SCI4_BRR        (RA6M5_SCI4_BASE + RA6M5_SCI_BRR_OFFSET)
#  define RA6M5_SCI4_SCR        (RA6M5_SCI4_BASE + RA6M5_SCI_SCR_OFFSET)
#  define RA6M5_SCI4_TDR        (RA6M5_SCI4_BASE + RA6M5_SCI_TDR_OFFSET)
#  define RA6M5_SCI4_SSR        (RA6M5_SCI4_BASE + RA6M5_SCI_SSR_OFFSET)
#  define RA6M5_SCI4_RDR        (RA6M5_SCI4_BASE + RA6M5_SCI_RDR_OFFSET)
#  define RA6M5_SCI4_SNFR       (RA6M5_SCI4_BASE + RA6M5_SCI_SNFR_OFFSET)
#  define RA6M5_SCI4_FTDRH      (RA6M5_SCI4_BASE + RA6M5_SCI_FTDRH_OFFSET)
#  define RA6M5_SCI4_FTDRL      (RA6M5_SCI4_BASE + RA6M5_SCI_FTDRL_OFFSET)
#  define RA6M5_SCI4_FRDRH      (RA6M5_SCI4_BASE + RA6M5_SCI_FRDRH_OFFSET)
#  define RA6M5_SCI4_FRDRL      (RA6M5_SCI4_BASE + RA6M5_SCI_FRDRL_OFFSET)
#  define RA6M5_SCI4_FCR        (RA6M5_SCI4_BASE + RA6M5_SCI_FCR_OFFSET)
#  define RA6M5_SCI4_FDR        (RA6M5_SCI4_BASE + RA6M5_SCI_FDR_OFFSET)
#  define RA6M5_SCI4_LSR        (RA6M5_SCI4_BASE + RA6M5_SCI_LSR_OFFSET)
#  define RA6M5_SCI4_SPTR       (RA6M5_SCI4_BASE + RA6M5_SCI_SPTR_OFFSET)
#  define RA6M5_SCI4_CR0        (RA6M5_SCI4_BASE + RA6M5_SCI_CR0_OFFSET)
#  define RA6M5_SCI4_CR1        (RA6M5_SCI4_BASE + RA6M5_SCI_CR1_OFFSET)
#  define RA6M5_SCI4_CR2        (RA6M5_SCI4_BASE + RA6M5_SCI_CR2_OFFSET)
#  define RA6M5_SCI4_CR3        (RA6M5_SCI4_BASE + RA6M5_SCI_CR3_OFFSET)
#  define RA6M5_SCI4_PCR        (RA6M5_SCI4_BASE + RA6M5_SCI_PCR_OFFSET)
#  define RA6M5_SCI4_ICR        (RA6M5_SCI4_BASE + RA6M5_SCI_ICR_OFFSET)
#  define RA6M5_SCI4_STR        (RA6M5_SCI4_BASE + RA6M5_SCI_STR_OFFSET)
#  define RA6M5_SCI4_STCR       (RA6M5_SCI4_BASE + RA6M5_SCI_STCR_OFFSET)
#endif

#if RA6M5_NSCI > 5
#  define RA6M5_SCI5_SMR        (RA6M5_SCI5_BASE + RA6M5_SCI_SMR_OFFSET)
#  define RA6M5_SCI5_BRR        (RA6M5_SCI5_BASE + RA6M5_SCI_BRR_OFFSET)
#  define RA6M5_SCI5_SCR        (RA6M5_SCI5_BASE + RA6M5_SCI_SCR_OFFSET)
#  define RA6M5_SCI5_TDR        (RA6M5_SCI5_BASE + RA6M5_SCI_TDR_OFFSET)
#  define RA6M5_SCI5_SSR        (RA6M5_SCI5_BASE + RA6M5_SCI_SSR_OFFSET)
#  define RA6M5_SCI5_RDR        (RA6M5_SCI5_BASE + RA6M5_SCI_RDR_OFFSET)
#  define RA6M5_SCI5_SNFR       (RA6M5_SCI5_BASE + RA6M5_SCI_SNFR_OFFSET)
#  define RA6M5_SCI5_FTDRH      (RA6M5_SCI5_BASE + RA6M5_SCI_FTDRH_OFFSET)
#  define RA6M5_SCI5_FTDRL      (RA6M5_SCI5_BASE + RA6M5_SCI_FTDRL_OFFSET)
#  define RA6M5_SCI5_FRDRH      (RA6M5_SCI5_BASE + RA6M5_SCI_FRDRH_OFFSET)
#  define RA6M5_SCI5_FRDRL      (RA6M5_SCI5_BASE + RA6M5_SCI_FRDRL_OFFSET)
#  define RA6M5_SCI5_FCR        (RA6M5_SCI5_BASE + RA6M5_SCI_FCR_OFFSET)
#  define RA6M5_SCI5_FDR        (RA6M5_SCI5_BASE + RA6M5_SCI_FDR_OFFSET)
#  define RA6M5_SCI5_LSR        (RA6M5_SCI5_BASE + RA6M5_SCI_LSR_OFFSET)
#  define RA6M5_SCI5_SPTR       (RA6M5_SCI5_BASE + RA6M5_SCI_SPTR_OFFSET)
#  define RA6M5_SCI5_CR0        (RA6M5_SCI5_BASE + RA6M5_SCI_CR0_OFFSET)
#  define RA6M5_SCI5_CR1        (RA6M5_SCI5_BASE + RA6M5_SCI_CR1_OFFSET)
#  define RA6M5_SCI5_CR2        (RA6M5_SCI5_BASE + RA6M5_SCI_CR2_OFFSET)
#  define RA6M5_SCI5_CR3        (RA6M5_SCI5_BASE + RA6M5_SCI_CR3_OFFSET)
#  define RA6M5_SCI5_PCR        (RA6M5_SCI5_BASE + RA6M5_SCI_PCR_OFFSET)
#  define RA6M5_SCI5_ICR        (RA6M5_SCI5_BASE + RA6M5_SCI_ICR_OFFSET)
#  define RA6M5_SCI5_STR        (RA6M5_SCI5_BASE + RA6M5_SCI_STR_OFFSET)
#  define RA6M5_SCI5_STCR       (RA6M5_SCI5_BASE + RA6M5_SCI_STCR_OFFSET)
#endif

#if RA6M5_NSCI > 6
#  define RA6M5_SCI6_SMR        (RA6M5_SCI6_BASE + RA6M5_SCI_SMR_OFFSET)
#  define RA6M5_SCI6_BRR        (RA6M5_SCI6_BASE + RA6M5_SCI_BRR_OFFSET)
#  define RA6M5_SCI6_SCR        (RA6M5_SCI6_BASE + RA6M5_SCI_SCR_OFFSET)
#  define RA6M5_SCI6_TDR        (RA6M5_SCI6_BASE + RA6M5_SCI_TDR_OFFSET)
#  define RA6M5_SCI6_SSR        (RA6M5_SCI6_BASE + RA6M5_SCI_SSR_OFFSET)
#  define RA6M5_SCI6_RDR        (RA6M5_SCI6_BASE + RA6M5_SCI_RDR_OFFSET)
#  define RA6M5_SCI6_SNFR       (RA6M5_SCI6_BASE + RA6M5_SCI_SNFR_OFFSET)
#  define RA6M5_SCI6_FTDRH      (RA6M5_SCI6_BASE + RA6M5_SCI_FTDRH_OFFSET)
#  define RA6M5_SCI6_FTDRL      (RA6M5_SCI6_BASE + RA6M5_SCI_FTDRL_OFFSET)
#  define RA6M5_SCI6_FRDRH      (RA6M5_SCI6_BASE + RA6M5_SCI_FRDRH_OFFSET)
#  define RA6M5_SCI6_FRDRL      (RA6M5_SCI6_BASE + RA6M5_SCI_FRDRL_OFFSET)
#  define RA6M5_SCI6_FCR        (RA6M5_SCI6_BASE + RA6M5_SCI_FCR_OFFSET)
#  define RA6M5_SCI6_FDR        (RA6M5_SCI6_BASE + RA6M5_SCI_FDR_OFFSET)
#  define RA6M5_SCI6_LSR        (RA6M5_SCI6_BASE + RA6M5_SCI_LSR_OFFSET)
#  define RA6M5_SCI6_SPTR       (RA6M5_SCI6_BASE + RA6M5_SCI_SPTR_OFFSET)
#  define RA6M5_SCI6_CR0        (RA6M5_SCI6_BASE + RA6M5_SCI_CR0_OFFSET)
#  define RA6M5_SCI6_CR1        (RA6M5_SCI6_BASE + RA6M5_SCI_CR1_OFFSET)
#  define RA6M5_SCI6_CR2        (RA6M5_SCI6_BASE + RA6M5_SCI_CR2_OFFSET)
#  define RA6M5_SCI6_CR3        (RA6M5_SCI6_BASE + RA6M5_SCI_CR3_OFFSET)
#  define RA6M5_SCI6_PCR        (RA6M5_SCI6_BASE + RA6M5_SCI_PCR_OFFSET)
#  define RA6M5_SCI6_ICR        (RA6M5_SCI6_BASE + RA6M5_SCI_ICR_OFFSET)
#  define RA6M5_SCI6_STR        (RA6M5_SCI6_BASE + RA6M5_SCI_STR_OFFSET)
#  define RA6M5_SCI6_STCR       (RA6M5_SCI6_BASE + RA6M5_SCI_STCR_OFFSET)
#endif

#if RA6M5_NSCI > 7
#  define RA6M5_SCI7_SMR        (RA6M5_SCI7_BASE + RA6M5_SCI_SMR_OFFSET)
#  define RA6M5_SCI7_BRR        (RA6M5_SCI7_BASE + RA6M5_SCI_BRR_OFFSET)
#  define RA6M5_SCI7_SCR        (RA6M5_SCI7_BASE + RA6M5_SCI_SCR_OFFSET)
#  define RA6M5_SCI7_TDR        (RA6M5_SCI7_BASE + RA6M5_SCI_TDR_OFFSET)
#  define RA6M5_SCI7_SSR        (RA6M5_SCI7_BASE + RA6M5_SCI_SSR_OFFSET)
#  define RA6M5_SCI7_RDR        (RA6M5_SCI7_BASE + RA6M5_SCI_RDR_OFFSET)
#  define RA6M5_SCI7_SNFR       (RA6M5_SCI7_BASE + RA6M5_SCI_SNFR_OFFSET)
#  define RA6M5_SCI7_FTDRH      (RA6M5_SCI7_BASE + RA6M5_SCI_FTDRH_OFFSET)
#  define RA6M5_SCI7_FTDRL      (RA6M5_SCI7_BASE + RA6M5_SCI_FTDRL_OFFSET)
#  define RA6M5_SCI7_FRDRH      (RA6M5_SCI7_BASE + RA6M5_SCI_FRDRH_OFFSET)
#  define RA6M5_SCI7_FRDRL      (RA6M5_SCI7_BASE + RA6M5_SCI_FRDRL_OFFSET)
#  define RA6M5_SCI7_FCR        (RA6M5_SCI7_BASE + RA6M5_SCI_FCR_OFFSET)
#  define RA6M5_SCI7_FDR        (RA6M5_SCI7_BASE + RA6M5_SCI_FDR_OFFSET)
#  define RA6M5_SCI7_LSR        (RA6M5_SCI7_BASE + RA6M5_SCI_LSR_OFFSET)
#  define RA6M5_SCI7_SPTR       (RA6M5_SCI7_BASE + RA6M5_SCI_SPTR_OFFSET)
#  define RA6M5_SCI7_CR0        (RA6M5_SCI7_BASE + RA6M5_SCI_CR0_OFFSET)
#  define RA6M5_SCI7_CR1        (RA6M5_SCI7_BASE + RA6M5_SCI_CR1_OFFSET)
#  define RA6M5_SCI7_CR2        (RA6M5_SCI7_BASE + RA6M5_SCI_CR2_OFFSET)
#  define RA6M5_SCI7_CR3        (RA6M5_SCI7_BASE + RA6M5_SCI_CR3_OFFSET)
#  define RA6M5_SCI7_PCR        (RA6M5_SCI7_BASE + RA6M5_SCI_PCR_OFFSET)
#  define RA6M5_SCI7_ICR        (RA6M5_SCI7_BASE + RA6M5_SCI_ICR_OFFSET)
#  define RA6M5_SCI7_STR        (RA6M5_SCI7_BASE + RA6M5_SCI_STR_OFFSET)
#  define RA6M5_SCI7_STCR       (RA6M5_SCI7_BASE + RA6M5_SCI_STCR_OFFSET)
#endif

#if RA6M5_NSCI > 8
#  define RA6M5_SCI8_SMR        (RA6M5_SCI8_BASE + RA6M5_SCI_SMR_OFFSET)
#  define RA6M5_SCI8_BRR        (RA6M5_SCI8_BASE + RA6M5_SCI_BRR_OFFSET)
#  define RA6M5_SCI8_SCR        (RA6M5_SCI8_BASE + RA6M5_SCI_SCR_OFFSET)
#  define RA6M5_SCI8_TDR        (RA6M5_SCI8_BASE + RA6M5_SCI_TDR_OFFSET)
#  define RA6M5_SCI8_SSR        (RA6M5_SCI8_BASE + RA6M5_SCI_SSR_OFFSET)
#  define RA6M5_SCI8_RDR        (RA6M5_SCI8_BASE + RA6M5_SCI_RDR_OFFSET)
#  define RA6M5_SCI8_SNFR       (RA6M5_SCI8_BASE + RA6M5_SCI_SNFR_OFFSET)
#  define RA6M5_SCI8_FTDRH      (RA6M5_SCI8_BASE + RA6M5_SCI_FTDRH_OFFSET)
#  define RA6M5_SCI8_FTDRL      (RA6M5_SCI8_BASE + RA6M5_SCI_FTDRL_OFFSET)
#  define RA6M5_SCI8_FRDRH      (RA6M5_SCI8_BASE + RA6M5_SCI_FRDRH_OFFSET)
#  define RA6M5_SCI8_FRDRL      (RA6M5_SCI8_BASE + RA6M5_SCI_FRDRL_OFFSET)
#  define RA6M5_SCI8_FCR        (RA6M5_SCI8_BASE + RA6M5_SCI_FCR_OFFSET)
#  define RA6M5_SCI8_FDR        (RA6M5_SCI8_BASE + RA6M5_SCI_FDR_OFFSET)
#  define RA6M5_SCI8_LSR        (RA6M5_SCI8_BASE + RA6M5_SCI_LSR_OFFSET)
#  define RA6M5_SCI8_SPTR       (RA6M5_SCI8_BASE + RA6M5_SCI_SPTR_OFFSET)
#  define RA6M5_SCI8_CR0        (RA6M5_SCI8_BASE + RA6M5_SCI_CR0_OFFSET)
#  define RA6M5_SCI8_CR1        (RA6M5_SCI8_BASE + RA6M5_SCI_CR1_OFFSET)
#  define RA6M5_SCI8_CR2        (RA6M5_SCI8_BASE + RA6M5_SCI_CR2_OFFSET)
#  define RA6M5_SCI8_CR3        (RA6M5_SCI8_BASE + RA6M5_SCI_CR3_OFFSET)
#  define RA6M5_SCI8_PCR        (RA6M5_SCI8_BASE + RA6M5_SCI_PCR_OFFSET)
#  define RA6M5_SCI8_ICR        (RA6M5_SCI8_BASE + RA6M5_SCI_ICR_OFFSET)
#  define RA6M5_SCI8_STR        (RA6M5_SCI8_BASE + RA6M5_SCI_STR_OFFSET)
#  define RA6M5_SCI8_STCR       (RA6M5_SCI8_BASE + RA6M5_SCI_STCR_OFFSET)
#endif

#if RA6M5_NSCI > 9
#  define RA6M5_SCI9_SMR        (RA6M5_SCI9_BASE + RA6M5_SCI_SMR_OFFSET)
#  define RA6M5_SCI9_BRR        (RA6M5_SCI9_BASE + RA6M5_SCI_BRR_OFFSET)
#  define RA6M5_SCI9_SCR        (RA6M5_SCI9_BASE + RA6M5_SCI_SCR_OFFSET)
#  define RA6M5_SCI9_TDR        (RA6M5_SCI9_BASE + RA6M5_SCI_TDR_OFFSET)
#  define RA6M5_SCI9_SSR        (RA6M5_SCI9_BASE + RA6M5_SCI_SSR_OFFSET)
#  define RA6M5_SCI9_RDR        (RA6M5_SCI9_BASE + RA6M5_SCI_RDR_OFFSET)
#  define RA6M5_SCI9_SNFR       (RA6M5_SCI9_BASE + RA6M5_SCI_SNFR_OFFSET)
#  define RA6M5_SCI9_FTDRH      (RA6M5_SCI9_BASE + RA6M5_SCI_FTDRH_OFFSET)
#  define RA6M5_SCI9_FTDRL      (RA6M5_SCI9_BASE + RA6M5_SCI_FTDRL_OFFSET)
#  define RA6M5_SCI9_FRDRH      (RA6M5_SCI9_BASE + RA6M5_SCI_FRDRH_OFFSET)
#  define RA6M5_SCI9_FRDRL      (RA6M5_SCI9_BASE + RA6M5_SCI_FRDRL_OFFSET)
#  define RA6M5_SCI9_FCR        (RA6M5_SCI9_BASE + RA6M5_SCI_FCR_OFFSET)
#  define RA6M5_SCI9_FDR        (RA6M5_SCI9_BASE + RA6M5_SCI_FDR_OFFSET)
#  define RA6M5_SCI9_LSR        (RA6M5_SCI9_BASE + RA6M5_SCI_LSR_OFFSET)
#  define RA6M5_SCI9_SPTR       (RA6M5_SCI9_BASE + RA6M5_SCI_SPTR_OFFSET)
#  define RA6M5_SCI9_CR0        (RA6M5_SCI9_BASE + RA6M5_SCI_CR0_OFFSET)
#  define RA6M5_SCI9_CR1        (RA6M5_SCI9_BASE + RA6M5_SCI_CR1_OFFSET)
#  define RA6M5_SCI9_CR2        (RA6M5_SCI9_BASE + RA6M5_SCI_CR2_OFFSET)
#  define RA6M5_SCI9_CR3        (RA6M5_SCI9_BASE + RA6M5_SCI_CR3_OFFSET)
#  define RA6M5_SCI9_PCR        (RA6M5_SCI9_BASE + RA6M5_SCI_PCR_OFFSET)
#  define RA6M5_SCI9_ICR        (RA6M5_SCI9_BASE + RA6M5_SCI_ICR_OFFSET)
#  define RA6M5_SCI9_STR        (RA6M5_SCI9_BASE + RA6M5_SCI_STR_OFFSET)
#  define RA6M5_SCI9_STCR       (RA6M5_SCI9_BASE + RA6M5_SCI_STCR_OFFSET)
#endif

/* Register Bitfield Definitions ********************************************/

/* Serial Mode Register */

#define SCI_SMR_CKS_SHIFT       (0)         /* Bits 1: Clock Select */
#define SCI_SMR_CKS_MASK        (3 << SCI_SMR_CKS_SHIFT)
#  define SCI_SMR_CKS(n)        (((n) << SCI_SMR_CKS_SHIFT) & SCI_SMR_CKS_MASK)

#define SCI_SMR_MP              (1 << 2)    /* Bit 2: Multi-Processor Mode */
#define SCI_SMR_STOP            (1 << 3)    /* Bit 3: Stop Bit Length */
#define SCI_SMR_PM              (1 << 4)    /* Bit 4: Parity Mode */
#define SCI_SMR_PE              (1 << 5)    /* Bit 5: Parity Enable */
#define SCI_SMR_CHR             (1 << 6)    /* Bit 6: Character Length */
#define SCI_SMR_CM              (1 << 7)    /* Bit 7: Communication Mode */

/* Serial Control Register */

#define SCI_SCR_CKE_SHIFT       (0)         /* Bits 1: Clock Enable */
#define SCI_SCR_CKE_MASK        (3 << SCI_SCR_CKE_SHIFT)
#  define SCI_SCR_CKE(n)        (((n) << SCI_SCR_CKE_SHIFT) & SCI_SCR_CKE_MASK)

#define SCI_SCR_TEIE            (1 << 2)    /* Bit 2: Transmit End Interrupt Enable */
#define SCI_SCR_MPIE            (1 << 3)    /* Bit 3: Multi-Processor Interrupt Enable */
#define SCI_SCR_RE              (1 << 4)    /* Bit 4: Receive Enable */
#define SCI_SCR_TE              (1 << 5)    /* Bit 5: Transmit Enable */
#define SCI_SCR_RIE             (1 << 6)    /* Bit 6: Receive Interrupt Enable */
#define SCI_SCR_TIE             (1 << 7)    /* Bit 7: Transmit Interrupt Enable */

/* Serial Status Register */

#define SCI_SSR_MPBT            (1 << 0)    /* Bit 0: Multi-Processor Bit Transfer */
#define SCI_SSR_MPB             (1 << 1)    /* Bit 1: Multi-Processor */
#define SCI_SSR_TEND            (1 << 2)    /* Bit 2: Transmit End Flag */
#define SCI_SSR_PER             (1 << 3)    /* Bit 3: Parity Error Flag */
#define SCI_SSR_FER             (1 << 4)    /* Bit 4: Framing Error Flag */
#define SCI_SSR_ORER            (1 << 5)    /* Bit 5: Overrun Error Flag */
#define SCI_SSR_RDRF            (1 << 6)    /* Bit 6: Receive Data Full Flag */
#define SCI_SSR_TDRE            (1 << 7)    /* Bit 7: Transmit Data Empty Flag */

/* Smart Card Mode Register */

