gmtcontrol/nuttx/arch/arm/src/ra6m5/hardware/ra6m5_sci.h
#define SCI_SCMR_RESET          (0xf2)      /* Reset value */

#define SCI_SCMR_SMIF           (1 << 0)    /* Bit 0: Smart Card Interface Mode Select */
#define SCI_SCMR_SINV           (1 << 2)    /* Bit 2: Transmitted/Received Data Invert */
#define SCI_SCMR_SDIR           (1 << 3)    /* Bit 3: Transmitted/Received Data Transfer Direction */
#define SCI_SCMR_CHR1           (1 << 4)    /* Bit 4: Character Length 1 */
#define SCI_SCMR_BCP2           (1 << 7)    /* Bit 7: Base Clock Pulse 2 */

/* Serial Extended Mode Register */

#define SCI_SEMR_BRME           (1 << 2)    /* Bit 2: Bit Rate Modulation Enable */

/* SPI Mode Register */

#define SCI_SPMR_CTSE           (1 << 1)    /* Bit 1: CTS Enable */
#define SCI_SPMR_CSTPEN         (1 << 3)    /* Bit 3: CTS external pin Enable */
#define SCI_SPMR_CKPOL          (1 << 6)    /* Bit 6: Clock Polarity Select */
#define SCI_SPMR_CKPH           (1 << 7)    /* Bit 7: Clock Phase Select */

/* Serial Port Register */

#define SCI_SPTR_RINV           (1 << 4)    /* Bit 4: RXD invert bit */
#define SCI_SPTR_TINV           (1 << 5)    /* Bit 5: TXD invert bit */

/* FIFO Control Register */

#define SCI_FCR_TTRG_SHIFT      (4)         /* Bits[7:4]: Transmit FIFO Data Trigger Number */
#define SCI_FCR_TTRG_MASK       (15 << SCI_FCR_TTRG_SHIFT)
#  define SCI_FCR_TTRG(n)       (((n) << SCI_FCR_TTRG_SHIFT) & SCI_FCR_TTRG_MASK)

#define SCI_FCR_RTRG_SHIFT      (8)         /* Bits[11:8]: Receive FIFO Data Trigger Number */
#define SCI_FCR_RTRG_MASK       (15 << SCI_FCR_RTRG_SHIFT)
#  define SCI_FCR_RTRG(n)       (((n) << SCI_FCR_RTRG_SHIFT) & SCI_FCR_RTRG_MASK)

#define SCI_FCR_RSTRG_SHIFT     (12)        /* Bits[15:12]: RTS Output Active Trigger Number Select */
#define SCI_FCR_RSTRG_MASK      (15 << SCI_FCR_RSTRG_SHIFT)
#  define SCI_FCR_RSTRG(n)      (((n) << SCI_FCR_RSTRG_SHIFT) & SCI_FCR_RSTRG_MASK)

/* Interrupt Control Register */

#define SCI_ICR_BFDIE           (1 << 0)    /* Bit 0: Break Field Low Width Detected Interrupt Enable */
#define SCI_ICR_CF0MIE          (1 << 1)    /* Bit 1: Control Field 0 Match Detected Interrupt Enable */


/****************************************************************************
 * Public Types
 ****************************************************************************/

/****************************************************************************
 * Public Data
 ****************************************************************************/

/****************************************************************************
 * Public Macros
 ****************************************************************************/

#define RA6M5_SCI_STOP(n)       (1 << (22 + (9-(n))))

#endif /* __ARCH_ARM_SRC_RA6M5_HARDWARE_RA6M5_SCI_H */
